---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.FittingParamsCauseGeometryToFailError
source: html/fe2f7a27-62ee-0006-0c8d-1b7491a79a29.htm
---
# Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.FittingParamsCauseGeometryToFailError Property

The one of parameters for the fitting is causing the geometry to fail.

## Syntax (C#)
```csharp
public static FailureDefinitionId FittingParamsCauseGeometryToFailError { get; }
```